tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/heater/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1E-06;
        relTol           0;
    };
}

PISO
{
    nNonOrthogonalCorrectors 1;
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;
}

// ************************************************************************* //
